import 'package:flutter/material.dart';

class Data {
  Data._();

  static List allData = [
    [
      {
        'name': 'ไข่เจียวทรงเครื่อง',
        'img': Image.asset(
          'assets/img/101.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['เนื้อหมู', '(ตามชอบ)'],
          ['ต้นหอม', '2 ต้น'],
          ['พริกแดง', '1 เม็ด'],
          ['ฮอทด็อกหั่นเต๋า', '(ตามชอบ)'],
          ['ชะอม', '(ตามชอบ)'],
          ['มะเขือเทศหั่นเต๋า', '(ตามชอบ)'],
          ['ซอสหอยนางรม', ''],
          ['น้ำมันพืช', ''],
        ],
        'howTo': [
          'ตั้งกระทะด้วยไฟอ่อน และใส่น้ำมันพืชลงไป',
          'นำไข่ไก่ 3 ฟอง ตอกใส่ชาม และใส่ส่วนผสมทั้งหมดลงไป ปรุงรสด้วยน้ำมันหอย',
          'เมื่อไฟร้อนแล้ว เทไข่ที่เตรียมไว้ ทอดจนฟู',
          'นำไข่ออกมาใส่จานพร้อมรับประทาน'
        ]
      },
      {
        'name': 'ข้าวผัดอเมริกัน',
        'img': Image.asset(
          'assets/img/201.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['น่องไก่', ''],
          ['ไส้กรอก', ''],
          ['เนยจืด', '30 กรัม'],
          ['กระเทียมสับ', '1 ช้อนโต๊ะ'],
          ['หอมใหญ่สับ', '¼ ถ้วย'],
          ['มะเขือเทศสับ', '¼ ถ้วย'],
          ['ถั่วลันเตา', '(ตามชอบ)'],
          ['ข้าวเสาไห้', '1 ถ้วย'],
          ['ข้าวหอมมะลิ', '1 ถ้วย'],
          ['ซอสมะเขือเทศ', '½ ถ้วย'],
          ['ซีอิ๊วขาว', '1 ช้อนโต๊ะ'],
          ['ซอสปรุงรส', '2 ช้อนชา'],
          ['น้ำตาลทราย', '2 ช้อนชา'],
          ['ลูกเกด', '(ตามชอบ)'],
        ],
        'howTo': [
          'ก่อนอื่นเลยต้องทอดไก่ ไส้กรอก ไข่ดาว หรือจะเพิ่มแฮมหรือเบคอนก็ได้ตามใจชอบ ทอดเสร็จแล้วมาวางพักไว้ในจาน',
          'จากนั้นก็ผัดข้าวต่อ ตั้งกระทะเปิดไฟปานกลาง ใส่เนยลงไปผัดกับกระเทียม หอมใหญ่ มะเขือเทศ แล้วถั่วลันเตา ผัดแค่พอสุก',
          'ตักข้าวใส่ลงไปโดยผสมระหว่างข้าวหอมมะลิกับข้าวเสาไห้ ปรุงรสด้วยซอสมะเขือเทศ ซีอิ๊วขาว ซอสปรุงรส และน้ำตาลทราย จากนั้นก็ผัดให้เข้ากัน เสร็จโรยลูกเกดลงไปแล้วผัดให้เข้ากันอีกครั้ง',
          'เพื่อความสวยงามให้ตักใส่ถ้วยแล้วนำไปคว่ำลงบนจาน ตกแต่งด้วยของทอดที่เราทอดไว้เมื่อสักครู่ เสร็จแล้วรับประทานได้ทันที'
        ]
      },
      {
        'name': 'เต้าหู้ผัดเสฉวน',
        'img': Image.asset(
          'assets/img/502.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['เต้าหู้ขาวนิ่มหั่นเป็นชิ้นสี่เหลี่ยม', '300 กรัม'],
          ['หมูสับ', '150 กรัม'],
          ['กระเทียมสับหยาบ', '1 ช้อนโต๊ะ'],
          ['ขิงสับละเอียด', '1 ช้อนชา'],
          ['​พริกชี้ฟ้าแดงสับหยาบ', '1 เม็ด'],
          ['​ต้นหอมซอย', '1 ช้อนโต๊ะ'],
          ['​ซอสพริกเสฉวนสำเร็จรูป', '3 ช้อนโต๊ะ'],
          ['​น้ำมันหอย', '1 ช้อนชา'],
          ['​น้ำตาลทราย', '½ ช้อนชา'],
          ['​น้ำมันงา', '1 ช้อนชา'],
          ['​น้ำเปล่า', '1 ถ้วย'],
          ['​แป้งข้าวโพด', '1½ ช้อนชา'],
          ['​น้ำเปล่าสำหรับละลายแป้ง', '¼ ถ้วย'],
          ['​น้ำมันรำข้าว', '1 ช้อนโต๊ะ']
        ],
        'howTo': [
          'ผัดกระเทียม ขิง พริกชี้ฟ้าแดงกับน้ำมันรำข้าวจนมีกลิ่นหอมแล้วใส่หมูสับผัดจนสุก ปรุงรสด้วยซอสพริกเสฉวน น้ำมันหอยน้ำตาลทราย และน้ำมันงา คนให้เข้ากัน จากนั้นใส่เต้าหู้ขาว ตามด้วยน้ำ รอจนเดือด',
          'ละลายแป้งข้าวโพดกับน้ำเทใส่ลงในกระทะ ใช้ตะหลิวคนเบาๆ จนเหนียวทั่วกันยกลง ตักใส่จาน โรยด้วยต้นหอมซอย รับประทานกับข้าวสวยร้อนๆ'
        ]
      },
      {
        'name': 'เบอร์เกอร์เนื้อ',
        'img': Image.asset(
          'assets/img/503.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['เนื้อบดหยาบผสมมัน 20%', '200 กรัม'],
          ['ขนมปังเบอร์เกอร์', '1 ชิ้น'],
          ['ชีส', '1 แผ่น'],
          ['เบคอน', '2 แผ่น'],
          ['​เครื่องปรุงรส หรือซอสเพิ่มรสชาติ', '']
        ],
        'howTo': [
          'นำเนื้อบดผสมมันที่เตรียมไว้ ปรุงรสเพิ่มเติมด้วยเกลือ พริกไทย และโรสแมร์รี่',
          'จากนั้นทำเนื้อให้เป็นแผ่นวงกลมหนาประมาณ 1 นิ้ว ใส่ในตู้เย็น พักทิ้งไว้ 15 นาที',
          'เมื่อเตรียมเนื้อเสร็จแล้ว จากนั้นมาทอดเบคอน หรือนำเบคอนไปอบเตรียมไว้เพื่อรอนำไปจัดเบอร์เกอร์',
          'หั่นผักที่อยากทานเตรียมไว้',
          'หั่นครึ่งขนมปังเบอร์เกอร์ที่เตรียมไว้ จากนั้นนำไปย่างไฟอ่อนทาเนยให้พอหอม แล้วพักไว้',
          'ทำซอสราดเบอร์เกอร์ ด้วยการผสมมายองเนส มัสตาร์ด ซอสพริก คนให้เข้ากันชิมรสชาติ(ตามชอบ)ใจ',
          'เมื่อได้ 15 นาที นำเนื้อที่พักไว้มาย่างบนกระทะที่ใส่เนยลงไปเพื่อเพิ่มความหอม ย่างสลับไป-มา ด้านละประมาณ 3 – 5 นาที่',
          'จากนั้นวางชีสไว้ด้านบนเนื้อ นำเข้าเตาอบ ประมาณ 20 วินาที',
          'จัดเรียงเบอร์เกอร์ได้เลย โดยอาจจะลำดับจาก ขนมปังด้านล่าง เนื้อ ราดซอส หอมใหญ่ เบคอน ผัก(ตามชอบ)ใจ และก็ขนมปังด้านบน เป็นอันได้เบอร์เกอร์เนื้อ สุดอร่อยไปทาน'
        ]
      },
      {
        'name': 'ขนมปังชุบไข่',
        'img': Image.asset(
          'assets/img/601.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['ขนมปังโฮลวีท', '1 แผ่น'],
          ['นมสด', ''],
          ['ไข่ไก่', '1 ฟอง'],
          ['เนย', ''],
          ['​น้ำผึ้ง', '']
        ],
        'howTo': [
          'ตอกไข่ ใส่นมจืดลงไป ตีให้เข้ากัน',
          'นำขนมปัง ชุบกับไข่',
          'ตั้งกระทะไฟอ่อน ใส่เนยลงไปละลายให้ทั่วกระทะ แล้วเอาขนมปังชุบไข่ที่เตรียมไว้วางลงบนกระทะ พลิกด้านไปมา เรื่อยๆจนเริ่มสุก',
          'หลังจากพลิกขนมปัง จนได้สีที่พอใจแล้ว ตักใส่จานราดด้วยน้ำผึ้ง แล้วทานได้เลย'
        ]
      }
    ],
    [
      {
        'name': 'ไข่เจียวทรงเครื่อง',
        'img': Image.asset(
          'assets/img/101.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['เนื้อหมู', '(ตามชอบ)'],
          ['ต้นหอม', '2 ต้น'],
          ['พริกแดง', '1 เม็ด'],
          ['ฮอทด็อกหั่นเต๋า', '(ตามชอบ)'],
          ['ชะอม', '(ตามชอบ)'],
          ['มะเขือเทศหั่นเต๋า', '(ตามชอบ)'],
          ['ซอสหอยนางรม', ''],
          ['น้ำมันพืช', ''],
        ],
        'howTo': [
          'ตั้งกระทะด้วยไฟอ่อน และใส่น้ำมันพืชลงไป',
          'นำไข่ไก่ 3 ฟอง ตอกใส่ชาม และใส่ส่วนผสมทั้งหมดลงไป ปรุงรสด้วยน้ำมันหอย',
          'เมื่อไฟร้อนแล้ว เทไข่ที่เตรียมไว้ ทอดจนฟู',
          'นำไข่ออกมาใส่จานพร้อมรับประทาน'
        ]
      },
      {
        'name': 'กะเพราไก่',
        'img': Image.asset(
          'assets/img/102.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['ถั่วฝักยาว', ''],
          ['เนื้อไก่', '300 กรัม'],
          ['ใบกระเพรา', '4-5 กิ่ง'],
          ['กระเทียม', '2 กลีบ'],
          ['พริก', '5-7 เม็ด'],
          ['ซอสปรุงรส', ''],
          ['น้ำมันหอย', ''],
          ['น้ำตาล', ''],
          ['น้ำมันพืช', ''],
        ],
        'howTo': [
          'นำพริกมาโคลกแบบหยาบ ๆ หั่นกระเทียมให้ละเอียด และหั่นถั่วฝักยาวเป็นแท่งเล็ก ๆ',
          'ตั้งกระทะใช้ปานกลาง ใส่น้ำมันพืชลงไปเล็กน้อย จากนั้นใส่กระเทียมและพริกลงไปผัดให้หอม',
          'ใส่ถั่วฝักยาวและเนื้อไก่ที่เตรียมไว้ลงไปผัดให้พอสุกกลาง ๆ ไม่ต้องสุกมาก',
          'ผัดคลุกเคล้าให้เข้ากัน ปรุงรสด้วยซอสปรุงรส น้ำตาล น้ำมันหอยให้ได้รสชาติกลมกล่อมตามต้องการ',
          'ผัดส่วนผสมทุกอย่างให้เข้ากัน เปิดแก๊สไฟอ่อน ใส่ใบกระเพราลงไปผัดสองสามครั้ง ปิดแก๊สตักใส่จาน พร้อมรับประทาน'
        ]
      },
      {
        'name': 'สามชั้นผัดพริกเกลือ',
        'img': Image.asset(
          'assets/img/103.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['หมูสามชั้น', '300 กรัม'],
          ['รากผักชีสับละเอียด', '5 ราก'],
          ['กระเทียมสับ', '5 กลีบ'],
          ['พริกขี้หนูสับหยาบ', '10 เม็ด'],
          ['เกลือ', '½ ช้อนชา'],
          ['ผงปรุงรส', '1 ช้อนโต๊ะ'],
          ['ผักชีซอย', '1 ต้น']
        ],
        'howTo': [
          'นำสามชั้นไปผัดในกระทะโดยไม่ต้องใช้น้ำมัน ผัดจนหมูสามชั้นเหลือง',
          'ใส่รากผักชี กระเทียมสับละเอียด และพริกขี้หนูสับผัดให้เข้ากัน จากนั้นปรุงรสด้วยผงปรุงรส และเกลือ',
          'ตักใส่จานที่เตรียมไว้ และโรยผักชี เพียงเท่านี้ก็พร้อมทาน'
        ]
      },
      {
        'name': 'ผัดพริกแกงหมู',
        'img': Image.asset(
          'assets/img/104.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['น้ำมัน', '2 ช้อนโต๊ะ'],
          ['พริกแกงเผ็ด', '1-2 ช้อนโต๊ะ'],
          ['หมูหั่น', '300 กรัม'],
          ['ถั่วฝักยาว', '20 ฝัก'],
          ['น้ำตาลทราย', '3-4 ช้อนชา'],
          ['ผงปรุงรส', '½ ช้อนชา'],
          ['น้ำปลา', '1 ช้อนโต๊ะ'],
          ['น้ำสะอาด', '½ ถ้วย']
        ],
        'howTo': [
          'ตั้งกระทะใส่น้ำมัน พริกแกงเผ็ด และ หมูหั่นลงไป ผัดให้หมูสุก',
          'ใส่ถั่วฝักยาว และ น้ำสะอาดลงไป ปรุงรสด้วย น้ำตาลทราย ผงปรุงรส และ น้ำปลา ชิมรส(ตามชอบ)',
          'ปิดไฟ ตักใส่จานพร้อมเสิร์ฟ ทานคู่กับไข่ดาว ราดด้วย พริกน้ำปลามะนาว'
        ]
      },
    ],
    [
      {
        'name': 'ข้าวผัดอเมริกัน',
        'img': Image.asset(
          'assets/img/201.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['น่องไก่', ''],
          ['ไส้กรอก', ''],
          ['เนยจืด', '30 กรัม'],
          ['กระเทียมสับ', '1 ช้อนโต๊ะ'],
          ['หอมใหญ่สับ', '¼ ถ้วย'],
          ['มะเขือเทศสับ', '¼ ถ้วย'],
          ['ถั่วลันเตา', '(ตามชอบ)'],
          ['ข้าวเสาไห้', '1 ถ้วย'],
          ['ข้าวหอมมะลิ', '1 ถ้วย'],
          ['ซอสมะเขือเทศ', '½ ถ้วย'],
          ['ซีอิ๊วขาว', '1 ช้อนโต๊ะ'],
          ['ซอสปรุงรส', '2 ช้อนชา'],
          ['น้ำตาลทราย', '2 ช้อนชา'],
          ['ลูกเกด', '(ตามชอบ)'],
        ],
        'howTo': [
          'ก่อนอื่นเลยต้องทอดไก่ ไส้กรอก ไข่ดาว หรือจะเพิ่มแฮมหรือเบคอนก็ได้ตามใจชอบ ทอดเสร็จแล้วมาวางพักไว้ในจาน',
          'จากนั้นก็ผัดข้าวต่อ ตั้งกระทะเปิดไฟปานกลาง ใส่เนยลงไปผัดกับกระเทียม หอมใหญ่ มะเขือเทศ แล้วถั่วลันเตา ผัดแค่พอสุก',
          'ตักข้าวใส่ลงไปโดยผสมระหว่างข้าวหอมมะลิกับข้าวเสาไห้ ปรุงรสด้วยซอสมะเขือเทศ ซีอิ๊วขาว ซอสปรุงรส และน้ำตาลทราย จากนั้นก็ผัดให้เข้ากัน เสร็จโรยลูกเกดลงไปแล้วผัดให้เข้ากันอีกครั้ง',
          'เพื่อความสวยงามให้ตักใส่ถ้วยแล้วนำไปคว่ำลงบนจาน ตกแต่งด้วยของทอดที่เราทอดไว้เมื่อสักครู่ เสร็จแล้วรับประทานได้ทันที'
        ]
      },
      {
        'name': 'ผัดไทยกุ้งสด',
        'img': Image.asset(
          'assets/img/202.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['กุ้งสด', '(ตามชอบ)'],
          ['เต้าหู้เหลืองหั่นเต๋า', '3 ช้อนโต๊ะ'],
          ['ไชโป๊สับละเอียด', '2 ช้อนโต๊ะ'],
          ['เส้นจันท์แช่น้ำจนนิ่ม', ''],
          ['​ถั่วงอกดิบ', ''],
          ['ใบกุยช่าย', ''],
          ['ไข่ไก่', '1 ฟอง'],
          ['​น้ำมันพืช', ''],
          ['ถั่วลิสงคั่วบด', ''],
          ['ผักสด', ''],
          ['น้ำตาลปี๊บ', '2 ช้อนโต๊ะ'],
          ['น้ำมะขามเปียก', '2 ช้อนโต๊ะ'],
          ['น้ำปลา', '2 ช้อนโต๊ะ'],
          ['พริกป่น', '(ตามชอบ)'],
        ],
        'howTo': [
          'ผสมน้ำตาลปี๊บ น้ำมะขามเปียก น้ำปลา และพริกป่นเข้าด้วยกัน นำขึ้นตั้งไฟพอร้อนและน้ำตาลปี๊บละลายเตรียมไว้',
          'ใส่เต้าหู้ลงไปผัดในกระทะใบเดิมพอให้เหลืองหอม ตามด้วยไชโป๊สับ ผัดพอเข้ากัน ใส่น้ำซอสผัดไทยที่เตรียมไว้ลงไปผัดให้เข้ากันจนเริ่มเดือด',
          'ใส่เส้นก๋วยเตี๋ยวที่แช่น้ำแล้วลงไปผัดให้เข้ากันเบา ๆ แล้วใช้ตะหลิวเขี่ยเส้นไปไว้ข้างกระทะ',
          'ตอกไข่ไก่ลงไป ยีให้พอแตก รอจนไข่เริ่มสุกแล้วนำส่วนผสมเส้นมาผัดให้เข้ากัน ตามด้วยกุ้งที่เตรียมไว้ตักใส่จาน เสิร์ฟพร้อมผัดสด ถั่วลิสงคั่วบด พริกป่น และมะนาว'
        ]
      },
      {
        'name': 'ข้าวผัดมันกุ้ง',
        'img': Image.asset(
          'assets/img/203.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['น้ำมันรำข้าว', ''],
          ['กระเทียมสับ', '2 ช้อนโต๊ะ'],
          ['มันกุ้ง', '80 กรัม'],
          ['เกลือ', '½ ช้อนชา'],
          ['กุ้งสด', '60 กรัม'],
          ['ข้าวสวย', '1 ถ้วย'],
          ['ซอสหอยนางรม', '2 ช้อนโต๊ะ'],
          ['แครอทซอย', '2 ช้อนโต๊ะ'],
          ['ต้นหอมซอย', '2 ช้อนโต๊ะ'],
          ['พริกไทยขาวป่น', '1 ช้อนชา']
        ],
        'howTo': [
          'ผัดกระเทียมสับ เทมันกุ้งลงไปผัดจนหอม ปรุงรสด้วยเกลือ ตามด้วยกุ้งสด',
          'ใส่ข้าวสวยลงไปคลุกกับมันกุ้ง ปรุงรสด้วยหอยนางรม ใส่แครอท ต้นหอม และพริกไทยขาว ผัดจนข้าวแห้งที่สุด จากนั้นก็ตักใส่จานเสิร์ฟ',
        ]
      }
    ],
    [
      {
        'name': 'นมสดทอด',
        'img': Image.asset(
          'assets/img/301.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['น้ำตาลทราย', '½ ถ้วย'],
          ['แป้งข้าวโพด', '½ ถ้วย'],
          ['นมสด', '3 ถ้วย'],
          ['เนยสด', '1 ช้อนโต๊ะ'],
          ['เครื่องเทศ', ''],
          ['ไข่ไก่', '2 ฟอง'],
          ['เกล็ดขนมปังป่น', '¾ ถ้วย'],
          ['น้ำมันพืช', ''],
          ['น้ำตาลไอซิ่ง', '']
        ],
        'howTo': [
          'ผสมนมสดกับน้ำตาลทรายให้เข้ากันในหม้อ กวนใช้ไฟกลาง ๆ แล้วค่อย ๆ แบ่งนมบางส่วนละลายลงในแป้งข้าวโพดแล้วเทลงไปคนในส่วนผสมแรก',
          'คนบนเตาอย่าหยุดมือ ใช้ไฟกลาง ๆ จนสุกใส ยกลงจากเตา ใส่เนย และผิวมะนาวขูด คนให้เข้ากัน',
          'เทใส่ถาดก้นแบน เกลี่ยให้เรียบ พักให้เย็น และนำเข้าตู้เย็น 3 ชั่วโมงหรือจนว่าจะแข็งได้ที่',
          'ตัดออกเป็นชิ้นสี่เหลี่ยม (ก่อนตัดให้เอามีดจุ่มน้ำ)',
          'นำไปชุบไข่ ตามด้วยเกล็ดขนมปังป่น',
          'เอาลงไปทอดจนเหลืองกรอบ จากนั้นก็โรยไอซิ่ง หรือน้ำตาลป่นผสมผงอบเชย ทำจนหมด เอาลงทอดไฟกลาง ๆ และโรยไอซิ่ง(ตามชอบ)',
        ]
      },
      {
        'name': 'ผักทอด',
        'img': Image.asset(
          'assets/img/302.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['แป้งโกกิ', '150 กรัม'],
          ['น้ำเย็น', '1 ถ้วยตวง'],
          ['เกลือ', '½ ช้อนชา'],
          ['ข้าวโพดอ่อน', ''],
          ['ถั่วฝักยาว', ''],
          ['แครอท', ''],
          ['ดอกแค', ''],
          ['น้ำมันพืช', '']
        ],
        'howTo': [
          'นำผักไปล้าง และหั่นเป็นชิ้นตามต้องการ',
          'นำแป้ง เกลือ มาผสมให้เข้ากัน จากนั้นค่อยๆเติมน้ำเย็นลงไป อย่าให้ข้นไปหรือเหลวไป',
          'ตั้งกระทะน้ำมันสำหรับทอด ใช้ไฟกลางๆ',
          'พอน้ำมันเริ่มร้อน นำผักที่หันไว้มาชุบกับแป้งที่ผสมไว้ แล้วนำลงทอด',
          'รอให้ผักที่เอาลงทอดลอยขึ้นมานั้นคือสุกแล้ว ดูสีให้สวยๆแล้วตักขึ้นได้เลยเป็นอันเรียบร้อย'
        ]
      },
      {
        'name': 'ไข่ม้วนญี่ปุ่น',
        'img': Image.asset(
          'assets/img/303.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['น้ำต้มสุก', '3 ช้อนโต๊ะ'],
          ['ผงดาชิ', '1 ช้อนโต๊ะ'],
          ['น้ำตาลทราย', '1½ ช้อนโต๊ะ'],
          ['ซีอิ๊วขาว', '1 ช้อนโต๊ะ'],
          ['เกลือป่น', ''],
          ['ไข่ไก่', '3 ฟอง'],
          ['น้ำซุป', ''],
          ['ผักชีซอย', '2 ช้อนโต๊ะ'],
          ['น้ำมันพืช', '']
        ],
        'howTo': [
          'ผสมน้ำต้มสุกกับผงดาชิ น้ำตาลทราย ซีอิ๊วขาว และเกลือป่น คนผสมจนละลายเข้ากัน เตรียมไว้',
          'ตีไข่ไก่พอแตก เทน้ำซุปใส่ลงไป ตามด้วยผักชีซอย คนผสมให้เข้ากัน',
          'ใช้ผ้าชุบน้ำมันพืชทากระทะให้ทั่ว นำขึ้นตั้งไฟจนร้อน แบ่งส่วนผสมไข่เทลงไปแล้วกลอกเป็นแผ่นให้ทั่วกระทะ รอจนไข่สุก (ถ้ามีฟองอากาศระหว่างการทอดให้ใช้ตะเกียบจิ้มนำอากาศออก) จากนั้นค่อย ๆ ม้วนไข่จากด้านบนกระทะย้อนกลับเข้าหาตัว จากนั้นขยับขึ้นไปไว้ด้านบนของกระทะ',
          'ใช้ผ้าชุบน้ำมันพืชทากระทะให้ทั่วอีกครั้ง เทส่วนผสมไข่อีกชั้นลงไปแล้วกรอกไข่เป็นแผ่นให้ทั่วกระทะเช่นเดิม โดยยกไข่ที่ม้วนไว้เมื่อครู่ขึ้นแล้วเอียงกระทะให้ไข่ที่ใส่ลงไปใหม่ไหลลงไปด้านล่าง) จากนั้นรอจนไข่สุก ค่อย ๆ ม้วนไข่ย้อนกลับเข้าหาตัวแล้วขยับขึ้นไปไว้ด้านบนกระทะ ทำซ้ำเช่นเดิมจนส่วนผสมไข่หมด',
          'ใช้ตะหลิวกดไข่ม้วนให้แบนและแน่น ตักขึ้น ตัดไข่ม้วนญี่ปุ่นเป็นชิ้น ๆ จัดใส่จาน พร้อมรับประทาน'
        ]
      },
    ],
    [
      {
        'name': 'ข้าวไรซ์เบอร์รีผัดปลานิล',
        'img': Image.asset(
          'assets/img/401.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['ปลานิลหั่นชิ้นสี่เหลี่ยมลูกเต๋า', '100 กรัม'],
          ['เกลือป่นหยาบ', ''],
          ['พริกไทยป่น', ''],
          ['แป้งทอดกรอบสำเร็จรูป', ''],
          ['น้ำมันพืช', ''],
          ['กระเทียมสับ', '1 ช้อนชา'],
          ['น้ำมันมะกอก', '1½ ช้อนชา'],
          ['แครอท หั่นเต๋า', '1 ช้อนโต๊ะ'],
          ['บรอกโคลี หั่นเต๋า', '1 ช้อนโต๊ะ'],
          ['ฟักทอง หั่นเต๋า', '1 ช้อนโต๊ะ'],
          ['ข้าวไรซ์เบอร์รีหุงสุก', '¾ ถ้วยตวง'],
          ['ซอสเห็ดหอม', '2 ช้อนชา'],
          ['ซีอิ๊วขาว', '½ ช้อนชา'],
          ['น้ำตาลทราย', '¼ ช้อนชา'],
          ['เมล็ดมะม่วงหิมพานต์ทอด', '6-7 เม็ด'],
          ['เมล็ดทานตะวันอบกรอบ', '1 ช้อนชา'],
          ['น้ำปลาผสมน้ำมะนาวและพริกขี้หนู', '']
        ],
        'howTo': [
          'โรยเกลือป่นและพริกไทยป่นบนเนื้อปลานิลแล้วคลุกลงในแป้งทอดกรอบพอทั่ว ใส่ลงทอดในน้ำมันพืชใช้ไฟปานกลาง ทอดจนสุกเหลือง ตักขึ้นพักให้สะเด็ดน้ำมัน เตรียมไว้',
          'เจียวกระเทียมกับน้ำมันมะกอกพอเหลืองหอม ใส่แครอท บรอกโคลี ฟักทอง และข้าวไรซ์เบอร์รีลงไปผัดเบา ๆ ให้เข้ากัน',
          'ปรุงรสด้วยซอสเห็ดหอม ซีอิ๊วขาว น้ำตาลทราย เกลือป่นและพริกไทยป่น ผัดให้เข้ากัน',
          'ใส่ปลาทอดลงไปตะล่อมเบา ๆ ให้เข้ากัน ตักใส่จานสำหรับเสิร์ฟ โรยเมล็ดมะม่วงหิมพานต์และเมล็ดทานตะวัน เสิร์ฟพร้อมน้ำปลาผสมน้ำมะนาวและพริกขี้หนู'
        ]
      },
      {
        'name': 'ผักบุ้งผัดน้ำมันหอย',
        'img': Image.asset(
          'assets/img/402.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['ผักบุ้ง', '2 กำ'],
          ['กระเทียม', '3-5 กลีบ'],
          ['เต้าเจี้ยว', '½ ช้อนโต๊ะ'],
          ['น้ำมันหอย', '½ ช้อนโต๊ะ'],
          ['น้ำตาล', '1 ช้อนชา'],
          ['พริกขี้หนู', '7 เม็ด']
        ],
        'howTo': [
          'เตรียมวัถุดิบ ล้างผักบุ้งหั่นเป็นท่อน ทุบพริกกระเทียมแบบหยาบๆ เตรียมเครื่องปรุงรส',
          'ตั้งกระทะให้ร้อนใส่น้ำมันเล็กน้อย นำพริกกระเทียมลงผัดจนเหลืองหอม จากนั้นใส่ผักบุ้งลงผัดพร้อมเต้าเจี้ยว',
          'พอผักบุ้งเริ่มสลดใส่เครื่องปรุงรส น้ำมันหอยและน้ำตาล เคล็ดลับ: ใช้ไฟแรง',
          'พอเดือดปิดไฟตักขึ้นใส่จาน ไม่ควรผัดนานเพราะผักบุ้งจะไม่กรอบ'
        ]
      },
      {
        'name': 'ราดหน้าเส้นหมี่หมู',
        'img': Image.asset(
          'assets/img/403.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['เส้นหมี่ข้าวกล้องแช่น้ำ', '¼ แพ็ค'],
          ['สันในหมู', '½ ขีด'],
          ['แคร์รอตหั่นแว่น', '⅓ ถ้วยตวง'],
          ['คะน้าฮ่องกงหั่นท่อน', '½ ถ้วยตวง'],
          ['​ข้าวโพดอ่อน', '⅓ ถ้วยตวง'],
          ['กระเทียม', '2 กลีบ'],
          ['​แป้งข้าวโพด', '1 ช้อนโต๊ะ'],
          ['ซอสหอยนางรม', '1 ช้อนโต๊ะ'],
          ['ซีอิ๊วขาว', '½ ช้อนโต๊ะ'],
          ['​น้ำตาลทราย', '2 ช้อนชา'],
          ['​เต้าเจี้ยว', '1 ช้อนชา'],
          ['​นมสด', '2 ช้อนโต๊ะ'],
          ['​ซีอิ๊วดำหวาน', '2 ช้อนชา']
        ],
        'howTo': [
          'นำเส้นหมี่ข้าวกล้องแช่น้ำ ลงผัดกับซีอิ๊วดำหวานให้เข้ากัน จนเส้นกลายเป็นสีน้ำตาล แล้วตักขึ้นพักไว้',
          'ใส่น้ำมันลงในกระทะเล็กน้อย ตามด้วยใส่กระเทียมลงไปผัดให้ส่งกลิ่นหอม แล้วใส่หมูลงไปผัดจนเกือบสุกตามด้วยผักทั้งหมด ผัดเล็กน้อย ใส่น้ำให้ท่วมเครื่องทั้งหมด ต้มให้พอเดือด ปรุงรสด้วย น้ำมันหอย ซีอิ๊วขาว น้ำตาลทราย และเต้าเจี้ยว คนให้เข้ากัน',
          'นำแป้งข้าวโพดไปคนกับน้ำให้ละลาย แล้วค่อย ๆ เทลงไปในหม้อขณะเดือด แล้วคนไปด้วย น้ำราดจะมีลักษณะเหนียวข้นมากขึ้น',
          'ตักเส้นที่ผัดไว้ขึ้นใส่จาน แล้วราดด้วยน้ำราด พร้อมรับประทาน'
        ]
      }
    ],
    [
      {
        'name': 'ข้าวห่อไข่สไตล์ญี่ปุ่น',
        'img': Image.asset(
          'assets/img/501.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['ข้าวญี่ปุ่นหุงสุก', '150 กรัม'],
          ['ซอสมะเขือเทศ', '1 ช้อนโต๊ะ'],
          ['ไวน์ขาว', '1 ช้อนโต๊ะ'],
          ['เนื้อหมู', '80 กรัม'],
          ['​หอมใหญ่หั่นสี่เหลี่ยม', '½ ลูก'],
          ['เมล็ดข้าวโพดต้มสุก', ''],
          ['​แครอทหั่นสี่เหลี่ยมต้มสุก', ''],
          ['เกลือ', ''],
          ['​พริกไทย', ''],
          ['​ไส้กรอกและผัดสดหรือลวก(ตามชอบ)', ''],
          ['​ไข่ไก่', '2 ฟอง'],
          ['​นมสด', '2 ช้อนโต๊ะ'],
          ['​นํ้ามันมะกอกสำหรับผัด', '']
        ],
        'howTo': [
          'ใส่นํ้ามันมะกอกลงในกระทะใช้ไฟกลาง ใส่หอมใหญ่ลงไปผัด แล้วตามด้วยเนื้อหมูจนสุก',
          'ใส่ข้าวลงไปตามด้วยไวน์ขาว เกลือ และซอสมะเขือเทศ',
          'ใส่เมล็ดข้าวโพด และแครอทลงไป ผัดให้เข้ากันแล้วตักใส่จานพักไว้',
          'ผสมไข่กับนม เกลือพอเข้ากัน ตั้งกระทะไฟอ่อนใส่นํ้ามะกอกลงไป กลอกนํ้ามันให้ทั่วกระทะ ใส่ไข่ลงไปครึ่งนึง',
          'ใช้ตะหลิวเขี่ยไข่เจียวห่อข้าวผัด',
          'ควํ่ากระทะลงบนจานสำหรับเสิร์ฟ พร้อมไส้กรอกและผัก(ตามชอบ)'
        ]
      },
      {
        'name': 'เต้าหู้ผัดเสฉวน',
        'img': Image.asset(
          'assets/img/502.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['เต้าหู้ขาวนิ่มหั่นเป็นชิ้นสี่เหลี่ยม', '300 กรัม'],
          ['หมูสับ', '150 กรัม'],
          ['กระเทียมสับหยาบ', '1 ช้อนโต๊ะ'],
          ['ขิงสับละเอียด', '1 ช้อนชา'],
          ['​พริกชี้ฟ้าแดงสับหยาบ', '1 เม็ด'],
          ['​ต้นหอมซอย', '1 ช้อนโต๊ะ'],
          ['​ซอสพริกเสฉวนสำเร็จรูป', '3 ช้อนโต๊ะ'],
          ['​น้ำมันหอย', '1 ช้อนชา'],
          ['​น้ำตาลทราย', '½ ช้อนชา'],
          ['​น้ำมันงา', '1 ช้อนชา'],
          ['​น้ำเปล่า', '1 ถ้วย'],
          ['​แป้งข้าวโพด', '1½ ช้อนชา'],
          ['​น้ำเปล่าสำหรับละลายแป้ง', '¼ ถ้วย'],
          ['​น้ำมันรำข้าว', '1 ช้อนโต๊ะ']
        ],
        'howTo': [
          'ผัดกระเทียม ขิง พริกชี้ฟ้าแดงกับน้ำมันรำข้าวจนมีกลิ่นหอมแล้วใส่หมูสับผัดจนสุก ปรุงรสด้วยซอสพริกเสฉวน น้ำมันหอยน้ำตาลทราย และน้ำมันงา คนให้เข้ากัน จากนั้นใส่เต้าหู้ขาว ตามด้วยน้ำ รอจนเดือด',
          'ละลายแป้งข้าวโพดกับน้ำเทใส่ลงในกระทะ ใช้ตะหลิวคนเบาๆ จนเหนียวทั่วกันยกลง ตักใส่จาน โรยด้วยต้นหอมซอย รับประทานกับข้าวสวยร้อนๆ'
        ]
      },
      {
        'name': 'เบอร์เกอร์เนื้อ',
        'img': Image.asset(
          'assets/img/503.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['เนื้อบดหยาบผสมมัน 20%', '200 กรัม'],
          ['ขนมปังเบอร์เกอร์', '1 ชิ้น'],
          ['ชีส', '1 แผ่น'],
          ['เบคอน', '2 แผ่น'],
          ['​เครื่องปรุงรส หรือซอสเพิ่มรสชาติ', '']
        ],
        'howTo': [
          'นำเนื้อบดผสมมันที่เตรียมไว้ ปรุงรสเพิ่มเติมด้วยเกลือ พริกไทย และโรสแมร์รี่',
          'จากนั้นทำเนื้อให้เป็นแผ่นวงกลมหนาประมาณ 1 นิ้ว ใส่ในตู้เย็น พักทิ้งไว้ 15 นาที',
          'เมื่อเตรียมเนื้อเสร็จแล้ว จากนั้นมาทอดเบคอน หรือนำเบคอนไปอบเตรียมไว้เพื่อรอนำไปจัดเบอร์เกอร์',
          'หั่นผักที่อยากทานเตรียมไว้',
          'หั่นครึ่งขนมปังเบอร์เกอร์ที่เตรียมไว้ จากนั้นนำไปย่างไฟอ่อนทาเนยให้พอหอม แล้วพักไว้',
          'ทำซอสราดเบอร์เกอร์ ด้วยการผสมมายองเนส มัสตาร์ด ซอสพริก คนให้เข้ากันชิมรสชาติ(ตามชอบ)ใจ',
          'เมื่อได้ 15 นาที นำเนื้อที่พักไว้มาย่างบนกระทะที่ใส่เนยลงไปเพื่อเพิ่มความหอม ย่างสลับไป-มา ด้านละประมาณ 3 – 5 นาที่',
          'จากนั้นวางชีสไว้ด้านบนเนื้อ นำเข้าเตาอบ ประมาณ 20 วินาที',
          'จัดเรียงเบอร์เกอร์ได้เลย โดยอาจจะลำดับจาก ขนมปังด้านล่าง เนื้อ ราดซอส หอมใหญ่ เบคอน ผัก(ตามชอบ)ใจ และก็ขนมปังด้านบน เป็นอันได้เบอร์เกอร์เนื้อ สุดอร่อยไปทาน'
        ]
      }
    ],
    [
      {
        'name': 'ขนมปังชุบไข่',
        'img': Image.asset(
          'assets/img/601.png',
          fit: BoxFit.cover,
        ),
        'ingredient': [
          ['ขนมปังโฮลวีท', '1 แผ่น'],
          ['นมสด', ''],
          ['ไข่ไก่', '1 ฟอง'],
          ['เนย', ''],
          ['​น้ำผึ้ง', '']
        ],
        'howTo': [
          'ตอกไข่ ใส่นมจืดลงไป ตีให้เข้ากัน',
          'นำขนมปัง ชุบกับไข่',
          'ตั้งกระทะไฟอ่อน ใส่เนยลงไปละลายให้ทั่วกระทะ แล้วเอาขนมปังชุบไข่ที่เตรียมไว้วางลงบนกระทะ พลิกด้านไปมา เรื่อยๆจนเริ่มสุก',
          'หลังจากพลิกขนมปัง จนได้สีที่พอใจแล้ว ตักใส่จานราดด้วยน้ำผึ้ง แล้วทานได้เลย'
        ]
      }
    ],
  ];
}
